python_data_type.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-04 Tue 00:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python - Data Type</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python - Data Type</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ffcafc">标量</a></li>
<li><a href="#orga3b7bc9">日期和时间</a></li>
<li><a href="#org0ca5969">元组</a></li>
<li><a href="#org46ffde4">列表</a></li>
<li><a href="#orgc74e6a2">内建序列函数</a></li>
<li><a href="#orgdf96749">字典</a></li>
<li><a href="#orgdf51a33">集合</a></li>
<li><a href="#org4006d5b">列表、字典和集合的推导式</a></li>
</ul>
</div>
</div>
<p>
Python中的大部分对象，如列表、字典、 <code>Numpy</code> 数组都是可变对象，大多数用户定义的类型（类）也是可变的。可变对象中包含的对象和值是可以被修改的。但是有一些对象是不可变的，如字符串、元组。
</p>
<div id="outline-container-org8ffcafc" class="outline-2">
<h2 id="org8ffcafc">标量</h2>
<div class="outline-text-2" id="text-org8ffcafc">
<p>
Python的标准库中有一个小的内建类型集合，用来处理数值、字符串、布尔值以及日期和时间。这类“单值”类型被称为标量。主要的标量类型有
</p>
<ul class="org-ul">
<li><code>int</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
<ul class="org-ul">
<li>前缀 <code>0x</code> 表示16进制整数。</li>
<li>整数除法会把结果自动转型为浮点数。</li>
<li>如果需要C风格的整数除法（去掉小数部分），可以使用整除操作符 <code>//</code> 。</li>
</ul></li>
<li><code>float</code><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li><code>str</code>
<ul class="org-ul">
<li>可以使用单引号 <code>'</code> 或双引号 <code>"</code> 写一个字符串字面值。</li>
<li>字符串是Unicode字符的序列，是不可改变的。很多Python对象可以通过函数 <code>str</code> 转成字符串。</li>
<li>对于单个字符，函数 <code>ord</code> 把字符转换为其对应的整数表示；函数 <code>chr</code> 把编码转换为对应的字符。</li>
<li>对于含有换行的多行字符串，可以使用三个单引号（ <code>'''</code> ）或三个双引号（ <code>"""</code> ）。</li>
<li>反斜杠 <code>\</code> 是转移符号，它用来指明特殊符号。可以在字符串前面加上前缀符号 <code>r</code> （raw的简写）避免对字符串转义。</li>
<li>字符串对象有一个 <code>format</code> 方法，可以用来代替字符串中的格式化参数，并产生一个新的字符串。</li>
<li>带有前缀符号 <code>f</code> （format的简写）的字符串被称之为 <code>f-string</code> 。如果其包含 <code>{xxx}</code> ，就会以对应的变量替换。</li>
</ul></li>
<li><code>bool</code>
<ul class="org-ul">
<li>布尔值有两个： <code>True</code> 和 <code>False</code> 。</li>
<li>布尔运算符包括： <code>and</code> ， <code>or</code> ， <code>not</code> 。</li>
</ul></li>
<li><code>None</code><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></li>
<li><code>bytes</code>
<ul class="org-ul">
<li>字符串在内存中以Unicode表示，每个字符对应若干个字节。</li>
<li>字符串在硬盘上存储或在网络上传输的时候，需要转换为以字节为单位的 <code>bytes</code> 类型。</li>
<li>在Python中， <code>bytes</code> 类型的数据为以前缀 <code>b</code> 开头的单引号（如 <code>b'xyz'</code> ， <code>b"xyz"</code> ）或双引号表示。</li>
<li><code>str</code> 的方法 <code>encode</code> 可以将其编码为制定的 <code>bytes</code> 。</li>
<li><code>bytes</code> 的方法 <code>decode</code> 可以将其转换为字符串（ <code>str</code> ）。</li>
<li><p>
当Python源代码中包含中文时，必须指定UTF-8编码保存。为了让Python解释器按照UTF-8编码读取Python程序代码，通常在源代码文件指定UTF-8编码。例如，文件开头为
</p>
<div class="org-src-container">
<pre class="src src-python">#!/usr/bin/env python
# -*- coding: utf-8 -*-
</pre>
</div></li>
</ul></li>
<li>常量
<ul class="org-ul">
<li>常量就是不能变的变量。在Python中，通常用全部大写的变量名来表示常量。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga3b7bc9" class="outline-2">
<h2 id="orga3b7bc9">日期和时间</h2>
<div class="outline-text-2" id="text-orga3b7bc9">
<p>
Python内建的 <code>datetime</code> 模块提供了 <code>datetime</code> ， <code>date</code> 和 <code>time</code> 类型。
</p>
<ul class="org-ul">
<li>对于 <code>datetime</code> 实例，可以分别使用 <code>date</code> 和 <code>time</code> 方法获取它的 <code>date</code> 和 <code>time</code> 对象。</li>
<li><code>strftime</code> 方法可以将 <code>datetime</code> 转换为字符串。格式化说明见下表。</li>
<li><code>strptime</code> 函数可以将字符串转换为 <code>datetime</code> 对象。</li>
<li><code>datetime.datetime</code> 是不可变类型。</li>
<li>两个不同的 <code>datetime</code> 对象可以产生一个 <code>datetime.timedelta</code> 对象。</li>
</ul>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">类型</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%Y</td>
<td class="org-left">四位数年份</td>
</tr>

<tr>
<td class="org-left">%y</td>
<td class="org-left">两位数年份</td>
</tr>

<tr>
<td class="org-left">%m</td>
<td class="org-left">两位数月份[01, 12]</td>
</tr>

<tr>
<td class="org-left">%d</td>
<td class="org-left">两位数的天数[01, 31]</td>
</tr>

<tr>
<td class="org-left">%H</td>
<td class="org-left">小时（24小时制）[00, 23]</td>
</tr>

<tr>
<td class="org-left">%I</td>
<td class="org-left">小时（12小时制）[01, 12]</td>
</tr>

<tr>
<td class="org-left">%M</td>
<td class="org-left">两位数分钟[00, 59]</td>
</tr>

<tr>
<td class="org-left">%S</td>
<td class="org-left">秒</td>
</tr>

<tr>
<td class="org-left">%w</td>
<td class="org-left">星期[0, 6]</td>
</tr>

<tr>
<td class="org-left">%U</td>
<td class="org-left">一年中的第几个星期值（星期天是每周第一天）[00, 53]</td>
</tr>

<tr>
<td class="org-left">%W</td>
<td class="org-left">一年中的第几个星期值（星期一是每周第一天）[00, 53]</td>
</tr>

<tr>
<td class="org-left">%z</td>
<td class="org-left">UTC时区偏移值</td>
</tr>

<tr>
<td class="org-left">%F</td>
<td class="org-left">%Y-%m-%d的简写</td>
</tr>

<tr>
<td class="org-left">%D</td>
<td class="org-left">%m/%d/%y的简写</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0ca5969" class="outline-2">
<h2 id="org0ca5969">元组</h2>
<div class="outline-text-2" id="text-org0ca5969">
<ul class="org-ul">
<li>元组是一种固定长度、不可变的Python对象序列。创建元组最简单的方法就是用逗号分隔序列值。</li>
<li>元组可嵌套，通常需要用括号将值包起来。</li>
<li>可以使用函数 <code>tuple</code> 将任意序列或迭代器转换为元组。</li>
<li>元组可以通过中括号 <code>[]</code> 来索引（获取）元组的元素<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>。</li>
<li>可以使用 <code>+</code> 连接元组生成更长的元组。</li>
<li>如果需要将元组表达式赋值给变量，Python会对等号右边的值进行拆包。即使是嵌套元组，也可以拆包。拆包的一个常用场景就是遍历元组或列表的序列。拆包过程中，带有 <code>*</code> 前缀的变量名可以匹配任意长度的位置参数列表。为了方便，可以使用下划线 <code>_</code> 表示不想要的变量。</li>
<li>方法 <code>count</code> 用于计算某个值在元组中出现的次数。</li>
</ul>
</div>
</div>
<div id="outline-container-org46ffde4" class="outline-2">
<h2 id="org46ffde4">列表</h2>
<div class="outline-text-2" id="text-org46ffde4">
<ul class="org-ul">
<li>可以使用中括号 <code>[]</code> 或者 函数 <code>list</code> 来定义列表。后者常用于将迭代器或者生成器转化为列表。</li>
<li>方法 <code>append</code> 用于将元素添加到列表的尾部。</li>
<li>方法 <code>insert</code> 用于将元素插入到列表的指定位置。其计算量高于 <code>append</code> 。</li>
<li>方法 <code>pop</code> 会将指定位置的元素移除并返回。</li>
<li>方法 <code>remove</code> 移除第一个符合值要求的元素。</li>
<li>方法 <code>extend</code> 向列表中添加多个元素。</li>
<li>方法 <code>sort</code> 对列表进行内部排序。</li>
<li>关键字 <code>in</code> 可以检查一个元素是否在列表中。其前可加关键字 <code>not</code> ，用于检查一个元素是否不在列表中。</li>
<li>可以使用 <code>+</code> 连接列表生成更长的列表。该过程需要创建新的列表，并且还要复制对象。</li>
<li>切片符号可以对大多数序列类型选取其子集，其基本形式为 <code>[start: stop: step]</code> 。
<ul class="org-ul">
<li>所选取子集包含起始位置 <code>start</code> ，不包含结束位置 <code>stop</code> ，所以选取子集的数量为 <code>stop - start</code> 。</li>
<li>索引可以为负值，意味着从序列的尾部进行索引。</li>
<li><code>start</code> ， <code>stop</code> ， <code>step</code> 均可省略，默认值分别为0，列表长度，1。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc74e6a2" class="outline-2">
<h2 id="orgc74e6a2">内建序列函数</h2>
<div class="outline-text-2" id="text-orgc74e6a2">
<ul class="org-ul">
<li>函数 <code>enumerate</code> 返回形如 <code>(索引值, 元素值)</code> 的元组的序列。</li>
<li>函数 <code>sorted</code> 对序列排序并返回新的有序序列。</li>
<li>函数 <code>zip</code> 将列表、元组或其他序列的元素配对，生成一个元组的列表并返回之。 <code>zip</code> 可以处理任意长度的序列，其生成的列表长度由最短的序列决定。</li>
<li>函数 <code>reversed</code> 将序列的元素逆序排列。</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf96749" class="outline-2">
<h2 id="orgdf96749">字典</h2>
<div class="outline-text-2" id="text-orgdf96749">
<ul class="org-ul">
<li>字典即哈希表或关联数组，是键值对（二元组）的集合。其中，键值都是Python对象，而且键必须是不可变的对象。</li>
<li>可以使用大括号 <code>{}</code> 创建字典，字典元素用逗号分隔，元素的键和值用冒号 <code>:</code> 分隔。</li>
<li>就像列表和元组一样，可以访问、插入、或设置字典中的元素。</li>
<li>关键字 <code>in</code> 可以用于检查字典中是否含有某个键。</li>
<li>可以使用关键字 <code>del</code> 或 方法 <code>pop</code> 根据键删除字典元素。其中，后者返回对应的值。</li>
<li>方法 <code>keys</code> 返回字典键的迭代器。</li>
<li>方法 <code>values</code> 返回字典值的迭代器。</li>
<li>方法 <code>update</code> 用于合并或更新字典。</li>
<li>方法 <code>hash</code> 可以检查一个对象是否可以哈希化，也即是否可以用作字典的键。</li>
<li>方法 <code>get</code> 可以返回一个默认值。也即</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">VALUE = SOME_DICT.get(KEY, DEFAULT_VALUE)
</pre>
</div>
<p>
等价于
</p>
<div class="org-src-container">
<pre class="src src-python">if KEY in SOME_DICT:
    VALUE = SOME_DICT[KEY]
else:
    VALUE = DEFAULT_VALUE
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf51a33" class="outline-2">
<h2 id="orgdf51a33">集合</h2>
<div class="outline-text-2" id="text-orgdf51a33">
<ul class="org-ul">
<li>集合是一种无序且元素唯一的容器。其元素必须是不可变的。</li>
<li>可以使用大括号 <code>{}</code> 或者方法 <code>set</code> 创建集合。</li>
<li>方法 <code>union</code> 或二元操作符 <code>|</code> 可以获得集合的并集。</li>
<li>方法 <code>intersection</code> 或二元操作符 <code>&amp;</code> 可以获得集合的交集。</li>
</ul>
</div>
</div>
<div id="outline-container-org4006d5b" class="outline-2">
<h2 id="org4006d5b">列表、字典和集合的推导式</h2>
<div class="outline-text-2" id="text-org4006d5b">
<ul class="org-ul">
<li>列表的推导式如下:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">LIST = [EXPRESSION for VALUE in COLLECTION if CONDITION]
</pre>
</div>
<p>
其等价于
</p>
<div class="org-src-container">
<pre class="src src-python">LIST = []
for VALUE in COLLECTION:
    if CONDITION:
        LIST.append(EXPRESSION)
</pre>
</div>
<p>
其中， <code>CONDITION</code> 可以省略。
</p>
<ul class="org-ul">
<li>字典的推导式如下:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">DICTIONARY = {KEY: VALUE for VALUE in COLLECTION if CONDITION}
</pre>
</div>
<ul class="org-ul">
<li>集合的推导式如下:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">SET = {EXPRESSION for VALUE in COLLECTION if CONDITION}
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
可以存储任意大小数字。 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
双精度64位数值。 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Python的 <code>null</code> 值，只存在一个实例。 如果一个函数没有显式的返回值，则它会隐式地返回 <code>None</code> 。它不仅是一个关键字，还是 <code>NoneType</code> 类型的唯一实例。
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
索引从0开始。 
</p></div></div>


</div>
</div></div>
</body>
</html>
